{"authorDailyContributionsMap":{"AK47ofCode":[{"date":"2026-01-27T00:00:00","commitResults":[{"hash":"85a259a512eb6fed07a1390aa3417a44a98036aa","isMergeCommit":false,"messageTitle":"Level 0: Add Rename, Greet, Exit","messageBody":"Duke.java: Rename the Java file and add a few new features\n\nDuke.java is the default file provided in the project template and needs to be modified to make it more unique and boast more features.\n\nRenaming the file to Sallybot.java, as well as modifying the greeting message and the ASCII text that is displayed along with it and adding an exit message.\n\nThe Duke Chatbot name is only a placeholder, and the project has since been renamed Sallybot, named after the Japanese-American voice actress Sally Amaki. Consequently, the greeting message has to be modified to reflect the change. A goodbye message is added to add more depth and friendliness.\n","tags":["Level-0"],"fileTypesAndContributionMap":{"java":{"insertions":16,"deletions":10}}}]},{"date":"2026-01-31T00:00:00","commitResults":[{"hash":"42203925e52eca23dc6ec1d6e5fc047954d2d71e","isMergeCommit":false,"messageTitle":"Level 1: Add Echo and command messages","messageBody":"Sallybot.java: Repeat a string message that a user types in the CLI, sends the goodbye message when the command \"bye\" is entered.\n\nThe previous iteration of Sallybot only had hello and bye messages and lacked interaction with the user via user input.\n\nHere, we add a Scanner input that takes a string entered by the user, and prints that exact same string on the CLI. We add a while loop to constantly prompt the user to enter a message until the command \"bye\" is sent. We use a case statement to handle the commands entered by the user, and the case block handles the break from the while loop when \"bye\" is entered such that the program quits.\n\nTo provide users with the choice of constantly entering messages without needing to restart the application each time a message is entered, a while loop is used. We expect more commands to be introduced, so a case statement is utilised.\n\nIn addition, the content of the greeting and bye messages have been modified to better reflect the intended character of Sallybot, which follows the personality of its namesake.\n","tags":["Level-1"],"fileTypesAndContributionMap":{"java":{"insertions":47,"deletions":11}}},{"hash":"c9e24e5ada030affe0b809d48b66b31686ef5dd5","isMergeCommit":false,"messageTitle":"Level 2: Add Tasks and List","messageBody":"So far, Sallybot has only a few main features, greet the user, take in user input and exit when the command \"bye\" is entered.\n\nSallybot needs more features to be more useful and appealing to users. New features need to be introduced to achieve this.\n\nWe add the functionality to store text into a dynamic array that stores tasks instead of merely echoing them, so users can use Sallybot to store their lists of to-dos. We introduce the command \"list\" to list out all tasks stored in the array so far.\n\nDoing so adds the purpose of taking down tasks and to-dos to Sallybot, contributing to its utility.\n","tags":["Level-2"],"fileTypesAndContributionMap":{"java":{"insertions":23,"deletions":10}}}]},{"date":"2026-02-01T00:00:00","commitResults":[{"hash":"9e0d9037fc26a9f19eeb1ba818162478d12778fe","isMergeCommit":false,"messageTitle":"Level 3: Mark as Done","messageBody":"Add the ability to mark tasks as done and change the status back to not done.\n\nPreviously, the task list had no capability of marking and displaying a task as completed or not.\n\nWe add new class Task to create task objects that come with a description and a status that indicates the completion status of a task, as well as new commands \"mark [index of task]\" and \"unmark [index of task]\" to mark a task at a certain index as done or not done respectively.\n\nThis adds more customizability and immersion to the Tasks feature of Sallybot.\n\nMinor additions such as Javadoc comments have been added.\n","tags":["Level-3"],"fileTypesAndContributionMap":{"java":{"insertions":112,"deletions":13}}}]}]},"authorFileTypeContributionMap":{"AK47ofCode":{"java":164,"md":0,"fxml":0,"sh":0,"bat":0,"gradle":0,"txt":0}},"authorContributionVariance":{"AK47ofCode":922.57635},"authorDisplayNameMap":{"AK47ofCode":"CS2113-T10-4 LEE ..N YI"}}
